#### Terraform working directory 🏠: `demo/demo-account/network/vpc`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.module.vpc["VPC-SGP-TST-C-1"].aws_flow_log.this[0] must be replaced
-/+ resource "aws_flow_log" "this" {
      ~ arn                      = "arn:aws:ec2:ap-southeast-1:129980683758:vpc-flow-log/fl-051aadd4a8b7835a9" -> (known after apply)
      ~ id                       = "fl-051aadd4a8b7835a9" -> (known after apply)
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      + log_group_name           = (known after apply)
        tags                     = {
            "test" = "test"
        }
        # (6 unchanged attributes hidden)

      ~ destination_options {
          ~ per_hour_partition         = false -> true # forces replacement
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
